Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.SystemsAnalysisReport Property
 An external resource type representing systems analysis report path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType SystemsAnalysisReport { get; }
Public Shared ReadOnly Property SystemsAnalysisReport As ExternalResourceType
	Get
public:
static property ExternalResourceType^ SystemsAnalysisReport {
	ExternalResourceType^ get ();
}
static member SystemsAnalysisReport : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace